1s/ERP/Conf/Enums/ВидыОперацийЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗЕРНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АннулированиеПартииПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеСписанияПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеФормированияПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированиеФормированияПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожае</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожаеАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнесениеСведенийОСобранномУрожаеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОстатковПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКлассификатора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКлассификатораАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросМестФормированияПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросМестФормированияПартийАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтказовПогашенийСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартийНаХранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПартийРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросПогашенийСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРеестраЭлеваторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРезультатовИсследований</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросРезультатовИсследованийАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСДИЗАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииСоздание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗКорректировочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗКорректировочныйРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеСДИЗЭлеватор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗАннулирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗАннулированиеРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеСДИЗРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПартиийРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИзДругихПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИзОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииНаОсновеБумажногоСДИЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПоРезультатамГосмониторинга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПриСбореУрожая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеПартииРасчетСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестоФормированияПартииИзменениеСтатуса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАктовОтбораПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросАктовОтбораПробАбстрактнаяОперация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ВидыОперацийЗЕРНО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЭтоАбстрактнаяОперация(ВидОперации) Экспорт
	
	Если АбстрактныеОперации().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ОперацияЯвляетсяОснованием(ВидОперации) Экспорт
	
	Если ОперацииОснования().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЭтоОперацияДополнительногоЗапроса(ВидОперации) Экспорт
	
	Если ОперацииССобственнымиЗапросами().Найти(ВидОперации) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция АбстрактныеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ФормированиеПартииРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(СписаниеПартиийРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросПартийРасчетСтатуса);
	МассивОпераций.Добавить(ПогашениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросКлассификатораАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросМестФормированияПартийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросРезультатовИсследованийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросСДИЗАбстрактнаяОперация);
	МассивОпераций.Добавить(ВнесениеСведенийОСобранномУрожаеРасчетСтатуса);
	МассивОпераций.Добавить(МестоФормированияПартииРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросАктовОтбораПробАбстрактнаяОперация);
	
	МассивОпераций.Добавить(ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗКорректировочныйРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке);
	МассивОпераций.Добавить(ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке);
	МассивОпераций.Добавить(ОформлениеКорректировкиСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ПогашениеСДИЗАннулированиеРасчетСтатуса);
	МассивОпераций.Добавить(КорректировкаПогашенияСДИЗРасчетСтатуса);
	
	МассивОпераций.Добавить(АннулированиеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(АннулированиеФормированияПартииРасчетСтатуса);
	МассивОпераций.Добавить(АннулированиеСДИЗПартииРасчетСтатуса);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииОснования() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ЗапросПартийРасчетСтатуса);
	МассивОпераций.Добавить(ЗапросКлассификатораАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросМестФормированияПартийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросРезультатовИсследованийАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросСДИЗАбстрактнаяОперация);
	МассивОпераций.Добавить(ЗапросАктовОтбораПробАбстрактнаяОперация);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииССобственнымиЗапросами()
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ЗапросРеестраЭлеваторов);
		
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРасчетСтатуса() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ФормированиеПартииРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(СписаниеПартиийРасчетСтатуса);
	МассивОпераций.Добавить(ПогашениеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ВнесениеСведенийОСобранномУрожаеРасчетСтатуса);
	МассивОпераций.Добавить(МестоФормированияПартииРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗОтказПогашенияСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗКорректировочныйРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке);
	МассивОпераций.Добавить(ОформлениеКорректировкиСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке);
	МассивОпераций.Добавить(КорректировкаПогашенияСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(ПогашениеСДИЗАннулированиеРасчетСтатуса);
	
	МассивОпераций.Добавить(АннулированиеСДИЗРасчетСтатуса);
	МассивОпераций.Добавить(АннулированиеФормированияПартииРасчетСтатуса);
	МассивОпераций.Добавить(АннулированиеСДИЗПартииРасчетСтатуса);
	
	
	Возврат МассивОпераций;
	
КонецФункции

Функция ОперацииРасчетСтатусаПоСтроке() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ОформлениеКорректировкиСДИЗРасчетСтатусаПоСтроке);
	МассивОпераций.Добавить(ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗРасчетСтатусаПоСтроке);
	
	Возврат МассивОпераций;
	
КонецФункции

Функция БазовыеОперации() Экспорт
	
	МассивОпераций = Новый Массив();
	МассивОпераций.Добавить(ФормированиеПартииИзОстатков);
	МассивОпераций.Добавить(ФормированиеПартииИмпорт);
	МассивОпераций.Добавить(ФормированиеПартииПоРезультатамГосмониторинга);
	МассивОпераций.Добавить(ФормированиеПартииПриСбореУрожая);
	МассивОпераций.Добавить(ФормированиеПартииИзДругихПартий);
	МассивОпераций.Добавить(ФормированиеПартииПроизводство);
	МассивОпераций.Добавить(АннулированиеФормированияПартии);
	
	МассивОпераций.Добавить(ОформлениеСДИЗИмпорт);
	МассивОпераций.Добавить(ОформлениеСДИЗЭкспорт);
	МассивОпераций.Добавить(ОформлениеСДИЗРФ);
	МассивОпераций.Добавить(ОформлениеСДИЗЭлеватор);
	МассивОпераций.Добавить(АннулированиеСДИЗ);
	
	МассивОпераций.Добавить(МестоФормированияПартииСоздание);
	МассивОпераций.Добавить(ПогашениеСДИЗ);
	МассивОпераций.Добавить(ПогашениеСДИЗАннулирование);
	МассивОпераций.Добавить(СписаниеПартии);
	
	МассивОпераций.Добавить(ОформлениеСДИЗОтказПогашенияСДИЗПриКорректировке);
	МассивОпераций.Добавить(ОформлениеСДИЗОтказПогашенияСДИЗ);
	МассивОпераций.Добавить(ОформлениеСДИЗАннулированиеОтказаПогашенияСДИЗ);
	МассивОпераций.Добавить(ОформлениеСДИЗКорректировочный);
	МассивОпераций.Добавить(АннулированиеСДИЗПриКорректировке);
	МассивОпераций.Добавить(АннулированиеПартииПриКорректировке);
	
	Возврат МассивОпераций;
	
КонецФункции

#КонецОбласти

#КонецЕсли
